<?php

interface Downloadable
{
    public const MAX_SIZE_MB = 2048;

    // В интерфейсе нет тел методов, потому что он задаёт требования к классу,
    //  а реализацию этих методов пишет сам класс.
    public function sizeMb(): int; 
    public function download(): string;


}


// В интерфейсе нет тел методов, потому что он только определяет, какие методы класс обязан реализовать.

// Абстрактный класс может содержать свойства и готовые методы с общей логикой,
// а интерфейс задаёт требования к классам.

// Класс может наследовать только один класс, но может реализовать несколько интерфейсов,
// потому что один класс может иметь несколько разных возможностей.